In [1]:
import pandas as pd

In [2]:
from sqlalchemy import create_engine

In [3]:
engine = create_engine("postgresql://root:root@localhost:5432/ny_taxi")

In [5]:
engine.connect()

In [30]:
# query = """
# SELECT
#     DATE(lpep_pickup_datetime),
#     COUNT(*) as trip_count
# FROM green_taxi_data
# WHERE DATE(lpep_pickup_datetime) BETWEEN '2019-10-01' AND '2019-10-31'
# GROUP BY 1 ORDER BY 1
# """
# df = pd.read_sql(query, con=engine)

# df

In [14]:
query = """
SELECT
    CASE 
        WHEN trip_distance <= 1 THEN 'Up to 1 mile'
        WHEN trip_distance > 1 AND trip_distance <= 3 THEN '1-3 miles'
        WHEN trip_distance > 3 AND trip_distance <= 7 THEN '3-7 miles'
        WHEN trip_distance > 7 AND trip_distance <= 10 THEN '7-10 miles'
        WHEN trip_distance > 10 THEN 'Over 10 miles'
    END AS distance_range,
    COUNT(*) as trip_count
FROM green_taxi_data
WHERE DATE(lpep_pickup_datetime) BETWEEN '2019-10-01' AND '2019-10-31'
  AND DATE(lpep_dropoff_datetime) <= '2019-10-31'
GROUP BY 1
"""
df = pd.read_sql(query, con=engine)

df.head()

  distance_range  trip_count
0      1-3 miles      198924
1      3-7 miles      109603
2     7-10 miles       27678
3  Over 10 miles       35189
4   Up to 1 mile      104802

In [20]:
query = """
SELECT DATE(lpep_pickup_datetime) AS pickup_dt, MAX(trip_distance)
FROM green_taxi_data
GROUP BY 1 ORDER BY 2 DESC LIMIT 5
"""
df = pd.read_sql(query, con=engine)

df

    pickup_dt     max
0  2019-10-31  515.89
1  2019-10-11   95.78
2  2019-10-26   91.56
3  2019-10-24   90.75
4  2019-10-05   85.23

In [35]:
query = """
SELECT
    zone."Zone",
    SUM(taxi.total_amount) AS amount
FROM green_taxi_data AS taxi
LEFT JOIN taxi_zone_lookup AS zone
       ON taxi."PULocationID" = zone."LocationID"
WHERE DATE(taxi.lpep_pickup_datetime) = '2019-10-18'
GROUP BY 1
ORDER BY 2 DESC
LIMIT 10
"""
df = pd.read_sql(query, con=engine)

df.head()

                  Zone    amount
0    East Harlem North  18686.68
1    East Harlem South  16797.26
2  Morningside Heights  13029.79
3       Central Harlem  12440.66
4             Elmhurst  12431.96

In [19]:
query = """
SELECT
    dropout_zone."Zone",
    MAX(taxi.tip_amount) AS max_tip_amount
FROM green_taxi_data AS taxi
LEFT JOIN taxi_zone_lookup AS pickup_zone
       ON taxi."PULocationID" = pickup_zone."LocationID"
LEFT JOIN taxi_zone_lookup AS dropout_zone
       ON taxi."DOLocationID" = dropout_zone."LocationID"
WHERE DATE(lpep_pickup_datetime) BETWEEN '2019-10-01' AND '2019-10-31'
  AND pickup_zone."Zone" = 'East Harlem North'
GROUP BY 1
ORDER BY 2 DESC
LIMIT 10
"""
df = pd.read_sql(query, con=engine)

df.head()

                    Zone  max_tip_amount
0            JFK Airport           87.30
1         Yorkville West           80.88
2      East Harlem North           40.00
3         Newark Airport           26.45
4  Upper East Side North           18.45

In [17]:
query = """
SELECT *
FROM green_taxi_data
LIMIT 10
"""
df = pd.read_sql(query, con=engine)

df.head()

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,2,2019-10-01 00:26:02,2019-10-01 00:39:58,N,1,112,196,1,5.88,18.0,0.50,0.5,0.00,0.0,None,0.3,19.30,2,1.0,0.0
1,1,2019-10-01 00:18:11,2019-10-01 00:22:38,N,1,43,263,1,0.80,5.0,3.25,0.5,0.00,0.0,None,0.3,9.05,2,1.0,0.0
2,1,2019-10-01 00:09:31,2019-10-01 00:24:47,N,1,255,228,2,7.50,21.5,0.50,0.5,0.00,0.0,None,0.3,22.80,2,1.0,0.0
3,1,2019-10-01 00:37:40,2019-10-01 00:41:49,N,1,181,181,1,0.90,5.5,0.50,0.5,0.00,0.0,None,0.3,6.80,2,1.0,0.0
4,2,2019-10-01 00:08:13,2019-10-01 00:17:56,N,1,97,188,1,2.52,10.0,0.50,0.5,2.26,0.0,None,0.3,13.56,1,1.0,0.0

In [21]:
query = """
SELECT *
FROM taxi_zone_lookup
LIMIT 10
"""
df = pd.read_sql(query, con=engine)

df.head()

   LocationID        Borough                     Zone service_zone
0           1            EWR           Newark Airport          EWR
1           2         Queens              Jamaica Bay    Boro Zone
2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3           4      Manhattan            Alphabet City  Yellow Zone
4           5  Staten Island            Arden Heights    Boro Zone

    pickup_dt     max
0  2019-10-31  515.89
1  2019-10-11   95.78
2  2019-10-26   91.56
3  2019-10-24   90.75
4  2019-10-05   85.23